20231229153446-1_building_blocks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1. Building blocks</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">1. Building blocks</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge16e348">1. Chapter 1. Building Blocks</a>
<ul>
<li><a href="#orgfa7488b">1.1. Exam Objectives</a>
<ul>
<li><a href="#orge5c5ee7">1.1.1. Handling date, time, text, numeric and boolean values</a></li>
<li><a href="#org71b3166">1.1.2. Utilizing Java Object­Oriented Approach</a></li>
</ul>
</li>
<li><a href="#org77988cc">1.2. Compiling</a></li>
<li><a href="#org8cc7895">1.3. Running</a></li>
<li><a href="#org5474864">1.4. Packages</a>
<ul>
<li><a href="#org114a4f3">1.4.1. WildCards</a></li>
<li><a href="#orgeca3e2d">1.4.2. Redundant imports</a></li>
<li><a href="#org5b12b35">1.4.3. Invalid imports</a></li>
<li><a href="#orgf69a59b">1.4.4. Naming Conflicts</a></li>
<li><a href="#org875520c">1.4.5. Creating a new package</a></li>
<li><a href="#orga107f4d">1.4.6. Creating a JAR file</a></li>
</ul>
</li>
<li><a href="#org4d0ed55">1.5. Constructors</a></li>
<li><a href="#org736fb3d">1.6. Order of Initialization</a></li>
<li><a href="#org9f92667">1.7. Types</a>
<ul>
<li><a href="#org4d4f166">1.7.1. Primitive Types</a></li>
<li><a href="#org6f536df">1.7.2. Reference Types</a></li>
<li><a href="#orgca53e28">1.7.3. Type Conversions</a></li>
</ul>
</li>
<li><a href="#orga8bd1de">1.8. Declaring Variables</a></li>
<li><a href="#orgafaf94f">1.9. Garbage Collection</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge16e348" class="outline-2">
<h2 id="orge16e348"><span class="section-number-2">1.</span> Chapter 1. Building Blocks</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgfa7488b" class="outline-3">
<h3 id="orgfa7488b"><span class="section-number-3">1.1.</span> Exam Objectives</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orge5c5ee7" class="outline-4">
<h4 id="orge5c5ee7"><span class="section-number-4">1.1.1.</span> Handling date, time, text, numeric and boolean values</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Use primitives and <code>wrapper</code> classes including <code>Math</code> API, parentheses, <b>type promotion</b>, and <b>casting</b> to evaluate <b>arithmetic</b> and <b>boolean</b> expressions.</li>
</ul>
</div>
</div>

<div id="outline-container-org71b3166" class="outline-4">
<h4 id="org71b3166"><span class="section-number-4">1.1.2.</span> Utilizing Java Object­Oriented Approach</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Declare and instantiate Java objects including <code>nested class</code> objects, and explain the object life­cycle including <code>creation</code>, <code>reassigning references</code>, and <code>garbage collection</code></li>
<li>Understand <b>variable scopes</b>, use local variable type inference, apply <a href="Encapsulation.md.html#ID-89e69431-4199-42ee-8633-4c2cc5da4d8a">encapsulation</a>, and make objects <b>immutable</b></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Instance Members</td>
<td class="org-left">The instance <code>variables</code> and instance <code>methods</code> of an object. They can be accessed or invoked only through an object reference.</td>
</tr>

<tr>
<td class="org-left">Instance Variable</td>
<td class="org-left">A <code>field</code> that is allocated when the class is instantiated (i.e.,when an object of the class is created). Also called a non-static field or just a field when the context is obvious.</td>
</tr>

<tr>
<td class="org-left">Instance method</td>
<td class="org-left">A <code>method</code> that belongs to an instance of the class. Objects of the same class share its implementation.</td>
</tr>

<tr>
<td class="org-left">Static Members</td>
<td class="org-left">The static <code>variables</code> and static <code>methods</code> of a class. They can be accessed or invoked either by using the class name or through an object reference.</td>
</tr>

<tr>
<td class="org-left">Static Variable</td>
<td class="org-left">A <code>field</code> that is allocated when the class is loaded. It belongs to the class, and not to any specific object of the class. Also called a static field or a class variable.</td>
</tr>

<tr>
<td class="org-left">Static Method</td>
<td class="org-left">A <code>method</code> that belongs to the class, and not to any object of the class. Also called a class method.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org77988cc" class="outline-3">
<h3 id="org77988cc"><span class="section-number-3">1.2.</span> Compiling</h3>
<div class="outline-text-3" id="text-1-2">
<p>
(See also: <a href="20231105195519-single_file_source_code.html#ID-17935397-ee6a-41e5-b492-4e3cc99c4c4a">Single File Source Code</a>)
Compiled using the <a href="20231224095703-javac.html#ID-d5b4004d-b5db-48a2-8e85-09359ca61a42">javac</a>
</p>

<ul class="org-ul">
<li>Each <code>class</code> declaration in a source file is compiled into a separate <code>class file</code>, containing its Java bytecode.</li>
<li>The name of this file comprises the name of the class with <code>.class</code> as its extension.</li>
<li>Although a Java source file can contain more than one class declaration, <a href="20231224095703-javac.html#ID-d5b4004d-b5db-48a2-8e85-09359ca61a42">javac</a> enforces the rule that there can <b>only be at the most</b> one class in the source file that has <code>public access</code> (<a href="20231229184943-top_level_type.html#ID-f7f87f85-1d9b-468a-8947-cd839883c9fa">Top-Level Type</a>).</li>
<li>If there is a <code>public class</code> in the source file, the name of the source file must be the name of the public class with <code>.java</code> as its extension.</li>
<li>In the <b>absence</b> of a public class in the source file, the name of the file can be arbitrary, but still with the <code>.java</code> extension.</li>
</ul>
</div>
</div>

<div id="outline-container-org8cc7895" class="outline-3">
<h3 id="org8cc7895"><span class="section-number-3">1.3.</span> Running</h3>
<div class="outline-text-3" id="text-1-3">
<p>
It is the <code>bytecode</code> in the class files that is executed when a Java program is run—the source code is irrelevant in this regard.
A Java program is run by the Java Application Launcher, <code>java</code>, which is also part of the <b>JDK</b>.
The <code>java</code> command creates an instance of the <b>JVM</b> that executes the bytecode.
</p>
</div>
</div>

<div id="outline-container-org5474864" class="outline-3">
<h3 id="org5474864"><span class="section-number-3">1.4.</span> Packages</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Java <code>classes</code> are grouped into <b>packages</b>
</p>
</div>

<div id="outline-container-org114a4f3" class="outline-4">
<h4 id="org114a4f3"><span class="section-number-4">1.4.1.</span> WildCards</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
A shortcut to import <b>all</b> the classes in a package is using a wildcard (<code>*</code>)
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">WildCards
</span><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.*; <span class="org-comment-delimiter">// </span><span class="org-comment">imports java.util.Random among other things
</span><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">NumberPicker</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        <span class="org-type">Random</span> <span class="org-variable-name">r</span> = <span class="org-keyword">new</span> <span class="org-type">Random</span>();
        System.out.println(r.nextInt(10));
    }
}
</pre>
</div>

<p>
Every class in the <code>java.util</code> package is available to this program when Java compiles it.
</p>

<p>
The import statement does <b>not</b> bring in <code>child packages, fields, or methods</code>.
It imports only <code>classes</code> <b>directly under the package</b>.
</p>
</div>
</div>

<div id="outline-container-orgeca3e2d" class="outline-4">
<h4 id="orgeca3e2d"><span class="section-number-4">1.4.2.</span> Redundant imports</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Already imported automatically: <code>import java.lang.*</code>
</p>
</div>
</div>

<div id="outline-container-org5b12b35" class="outline-4">
<h4 id="org5b12b35"><span class="section-number-4">1.4.3.</span> Invalid imports</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Which import statements do you think would not work to get this code to compile?
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">InputImports</span> {
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">read</span>(<span class="org-type">Files</span> <span class="org-variable-name">files</span>) {
        Paths.get(<span class="org-string">"name"</span>);
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Invalid Imports
</span><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">nio</span>.*;<span class="org-comment-delimiter">// </span><span class="org-comment">NO GOOD -&#173;a wildcard only matches // class names, not "file.Files"
</span><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">nio</span>.*.*;<span class="org-comment-delimiter">// </span><span class="org-comment">NO GOOD -&#173;you can only have one wildcard // and it must be at the end
</span><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">nio</span>.<span class="org-constant">file</span>.<span class="org-constant">Paths</span>.*; <span class="org-comment-delimiter">// </span><span class="org-comment">NO GOOD -&#173;you cannot import methods // only class names</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Valid Imports
</span><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">nio</span>.<span class="org-constant">file</span>.*;
<span class="org-comment-delimiter">// </span><span class="org-comment">OR
</span><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">nio</span>.<span class="org-constant">file</span>.<span class="org-type">Files</span>;
<span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">nio</span>.<span class="org-constant">file</span>.<span class="org-type">Paths</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf69a59b" class="outline-4">
<h4 id="orgf69a59b"><span class="section-number-4">1.4.4.</span> Naming Conflicts</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Example: Java provides 2 implementations of the Date class: <code>java.util.Date</code> and <code>java.sql.Date</code>
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Collision
</span><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.*;
<span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">sql</span>.*; <span class="org-comment-delimiter">// </span><span class="org-comment">causes Date declaration to not compile</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Correct imports
</span><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-type">Date</span>;
<span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">sql</span>.*;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Using Fully-Qualified Domain Names
</span><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Conflicts</span> {
    <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-type">Date</span> <span class="org-variable-name">date</span>;
    <span class="org-constant">java</span>.<span class="org-constant">sql</span>.<span class="org-type">Date</span> <span class="org-variable-name">sqlDate</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org875520c" class="outline-4">
<h4 id="org875520c"><span class="section-number-4">1.4.5.</span> <a href="20231230051200-creating_a_new_package.html#ID-c13f080f-e542-44d0-8311-5e4cdb388991">Creating a new package</a></h4>
</div>
<div id="outline-container-orga107f4d" class="outline-4">
<h4 id="orga107f4d"><span class="section-number-4">1.4.6.</span> <a href="20231230053451-creating_a_jar_file.html#ID-e40da6d4-9a59-46c8-9a2f-c375c0d7dda8">Creating a JAR file</a></h4>
</div>
</div>
<div id="outline-container-org4d0ed55" class="outline-3">
<h3 id="org4d0ed55"><span class="section-number-3">1.5.</span> <a href="Constructors.md.html#ID-73a0f36b-e440-486a-bd88-6ca577be3351">Constructors</a></h3>
</div>
<div id="outline-container-org736fb3d" class="outline-3">
<h3 id="org736fb3d"><span class="section-number-3">1.6.</span> <a href="20231230055218-order_of_initialization.html#ID-f041c4e7-7bfa-4554-9b25-6e6b8e086aec">Order of Initialization</a></h3>
</div>

<div id="outline-container-org9f92667" class="outline-3">
<h3 id="org9f92667"><span class="section-number-3">1.7.</span> Types</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-org4d4f166" class="outline-4">
<h4 id="org4d4f166"><span class="section-number-4">1.7.1.</span> <a href="20231230083124-primitive_types.html#ID-46582863-7f97-448d-bbc7-f7da4c1e7574">Primitive Types</a></h4>
</div>
<div id="outline-container-org6f536df" class="outline-4">
<h4 id="org6f536df"><span class="section-number-4">1.7.2.</span> <a href="20231230083220-reference_types.html#ID-ef3f4798-9f1d-462f-8eea-df2b75e512f6">Reference Types</a></h4>
</div>
<div id="outline-container-orgca53e28" class="outline-4">
<h4 id="orgca53e28"><span class="section-number-4">1.7.3.</span> <a href="20231224190412-type_conversions.html#ID-a290d25a-c231-441d-85d4-1d7be3f3cb3f">Type Conversions</a></h4>
</div>
</div>
<div id="outline-container-orga8bd1de" class="outline-3">
<h3 id="orga8bd1de"><span class="section-number-3">1.8.</span> <a href="20231230155210-declaring_variables.html#ID-c09c67cd-b686-417d-8b4b-bb26331a6997">Declaring Variables</a></h3>
</div>
<div id="outline-container-orgafaf94f" class="outline-3">
<h3 id="orgafaf94f"><span class="section-number-3">1.9.</span> <a href="20231230181407-garbage_collection.html#ID-9ccc2e2b-e387-499a-aaef-790bb6c1caa3">Garbage Collection</a></h3>
</div>
</div>
</div>
</body>
</html>
